# Brewfile

cask_args no_quarantine: true

tap "homebrew/cask-versions"
tap "homebrew/homebrew-cask-drivers"

{{- if eq .chezmoi.os "darwin" }}

# seems to be required to install python 3.7.10 via pyenv
brew "openssl" 
brew "readline" 
brew "sqlite3" 
brew "xz" 
brew "zlib"

brew "awscli"
brew "chezmoi"                                        
brew "golang"
brew "jq"
brew "pyenv"
brew "tfenv"
brew "vim"

cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
cask "lastpass"

mas "Slack", id: 803453959
mas "Xcode", id: 497799835

{{ end }}